[
    {
        "id": "1",
        "title": "DIU CSE Department Launches New AI Research Center",
        "excerpt": "The department has inaugurated a state-of-the-art AI research facility to foster innovation and collaboration between students, faculty, and industry partners.",
        "content": "Dhaka International University's Computer Science and Engineering department has officially launched its new Artificial Intelligence Research Center, marking a significant milestone in the university's commitment to cutting-edge technology education and research...",
        "category": "University News",
        "date": "2025-07-05",
        "author": "DIU News Team",
        "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?w=600&h=400&fit=crop",
        "featured": true,
        "active": true,
        "slug": "ai-research-center-launch"
    },
    {
        "id": "2",
        "title": "Alumni Scholarship Program Launches",
        "excerpt": "New scholarship initiative to support current students through alumni contributions, providing financial assistance to deserving students.",
        "content": "The DIU CSE Alumni Association has announced a new scholarship program aimed at supporting current students who demonstrate academic excellence and financial need...",
        "category": "Alumni News",
        "date": "2025-06-28",
        "author": "Alumni Association",
        "image": "https://images.unsplash.com/photo-1521737604893-d14cc237f11d?w=400&h=300&fit=crop",
        "featured": false,
        "active": true,
        "slug": "alumni-scholarship-program"
    },
    {
        "id": "3",
        "title": "Tech Talk Series Returns with Industry Leaders",
        "excerpt": "Monthly tech talks featuring alumni speakers from leading tech companies, sharing insights on emerging technologies and career growth.",
        "content": "The popular Tech Talk series is back with an exciting lineup of speakers from major technology companies. This month features alumni working at Google, Microsoft, and Amazon...",
        "category": "Events",
        "date": "2025-06-20",
        "author": "Event Committee",
        "image": "https://images.unsplash.com/photo-1517180102446-f3ece451e9d8?w=400&h=300&fit=crop",
        "featured": false,
        "active": true,
        "slug": "tech-talk-series-return"
    },
    {
        "id": "4",
        "title": "Global Alumni Network Expansion",
        "excerpt": "Expanding our reach with new chapters in North America and Europe, connecting DIU CSE graduates worldwide.",
        "content": "The DIU CSE Alumni Association is proud to announce the establishment of new regional chapters in North America and Europe, strengthening our global network...",
        "category": "Network",
        "date": "2025-06-15",
        "author": "Global Network Team",
        "image": "https://images.unsplash.com/photo-1524178232363-1fb2b075b655?w=400&h=300&fit=crop",
        "featured": false,
        "active": true,
        "slug": "global-network-expansion"
    },
    {
        "id": "5",
        "title": "DIU CSE Students Win International Programming Contest",
        "excerpt": "Our current students have brought glory to the university by securing top positions in the International Collegiate Programming Contest.",
        "content": "Students from Dhaka International University's CSE department have achieved remarkable success in the recent International Collegiate Programming Contest...",
        "category": "Achievement",
        "date": "2025-06-10",
        "author": "Academic Team",
        "image": "https://images.unsplash.com/photo-1523240795612-9a054b0db644?w=400&h=300&fit=crop",
        "featured": false,
        "active": true,
        "slug": "programming-contest-victory"
    }
]
